app/controllers/author/courses_controller.rb

SELECT "courses".* FROM "courses" ORDER BY "courses"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def index
      @courses = Course.all

INSERT INTO "courses" ("title", "description", "published", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "test 2"], ["description", "testd ;lok"], ["published", 0], ["created_at", "2021-01-29 17:12:51.277457"], ["updated_at", "2021-01-29 17:12:51.277457"], ["user_id", 6]]
---
    def create
      # @course = Course.new(course_params)
      @course = current_user.courses.build(course_params)
      @course.user = current_user
        if @course.save

UPDATE "courses" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["title", "java script2"], ["description", "asasas2"], ["updated_at", "2021-01-29 15:21:42.620134"], ["id", 1]]
---
    def update
      respond_to do |format|
        if @course.update(course_params)

SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = ? AND "courses"."id" = ? LIMIT ?  [["user_id", 6], ["id", 3], ["LIMIT", 1]]
---
    def set_course
      @course = current_user.courses.find(params[:id])