app/controllers/author/lessons_controller.rb

INSERT INTO "lessons" ("title", "body", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "lesson 2"], ["body", "sss"], ["course_id", 1], ["created_at", "2021-01-29 15:44:53.211894"], ["updated_at", "2021-01-29 15:44:53.211894"]]
---
    def create
      @lesson = Lesson.new(lesson_params)
      @lesson.course = @course

      if @lesson.save

UPDATE "lessons" SET "title" = ?, "updated_at" = ? WHERE "lessons"."id" = ?  [["title", "test44"], ["updated_at", "2021-01-29 16:27:08.331672"], ["id", 9]]
---
    def update
      if @lesson.update(lesson_params)

DELETE FROM "lessons" WHERE "lessons"."id" = ?  [["id", 5]]
---
    def destroy
      @lesson.destroy

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_course
      @course = current_user.courses.find(params[:course_id])

SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = ? AND "lessons"."id" = ? LIMIT ?  [["course_id", 1], ["id", 5], ["LIMIT", 1]]
---
    def set_lesson
      @lesson = @course.lessons.find(params[:id])