app/views/lessons/show.html.erb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = ? AND "lessons"."id" = ? LIMIT ?  [["course_id", 1], ["id", 1], ["LIMIT", 1]]
---
            <ul class="list-group list-group-flush">
              <% @course.lessons.each do |lesson| %>