app/views/courses/show.html.erb

            <table class="table table-hover">
                  <% @course.lessons.each do |lesson| %>
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = ?  [["course_id", 3]]