app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT "courses".* FROM "courses" ORDER BY "courses"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("title", "description", "published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "java script"], ["description", "hasjnudnckjd c"], ["published", 0], ["created_at", "2021-01-19 15:26:29.890853"], ["updated_at", "2021-01-19 15:26:29.890853"]]

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["title", "ruby an rails"], ["description", " test ruby an rails"], ["updated_at", "2021-01-20 10:40:54.952382"], ["id", 1]]