app/controllers/lessons_controller.rb

  def set_course
    @course = Course.find(params[:course_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_lesson
    @lesson = @course.lessons.find(params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = ? AND "lessons"."id" = ? LIMIT ?  [["course_id", 1], ["id", 1], ["LIMIT", 1]]