app/models/course.rb

SELECT "courses".* FROM "courses" ORDER BY "courses"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def next_lesson(lesson)
    index = lessons.find_index { |l| l.id == lesson.id }