app/views/author/courses/index.html.erb


<%= line_chart Course.group_by_day(:created_at).count %>
---
SELECT "courses".* FROM "courses" ORDER BY "courses"."id" ASC LIMIT ?  [["LIMIT", 1]]