app/views/author/courses/show.html.erb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = ?  [["course_id", 1]]
---
<div class="mb-5">
  <% @course.lessons.each do |lesson| %>